{
    "AccessDenied": "Access denied. You do not have permission to access this resource",
    "AccountAlreadyVerified": "Account already verified. You can log in now",
    "AccountNotYetVerified": "Account not yet verified. Please verify your account to proceed",
    "BannedUser": "Account banned. Please contact support for assistance",
    "CannotDeleteAdminAccount": "Cannot delete admin account. Admin accounts are essential for system functionality",
    "CountryNotFound": "Country not found. Please select a valid country",
    "EmailAlreadyExists": "This email address is already in use. Choose a different email",
    "EmailNotFound": "Email not found. Verify the email address provided",
    "InvalidArrayFormat": "Invalid array format. Please provide a valid array",
    "InvalidCity": "Invalid city. Please enter a valid city name",
    "InvalidEmailFormat": "Invalid email format. Please enter a valid email address",
    "InvalidObjectId": "Invalid object ID. Please provide a valid object ID",
    "InvalidPageNumberFormat": "Page number must be an integer. Please enter a valid page number",
    "InvalidPageNumberValue": "Page number must be at least 1. Please enter a valid page number",
    "InvalidPageSizeFormat": "Page size must be an integer. Please enter a valid page size",
    "InvalidPageSizeValue": "Page size must be at least 5. Please enter a valid page size",
    "InvalidPasswordResetToken": "Invalid password reset token. Please request a new password reset",
    "InvalidState": "Invalid state. Please enter a valid state",
    "InvalidVerificationToken": "Invalid verification token. Please request a new verification token",
    "PasswordAlreadyCreated": "Password is already created. You can log in now",
    "PasswordLength": "Password must be at least 8 characters long. Please choose a stronger password",
    "PasswordNotYetCreated": "Password not yet created. Please create a password to proceed",
    "PasswordResetTokenExpired": "Password reset token expired. Please request a new password reset",
    "PermissionNotFound": "Permission not found. Please select a valid permission",
    "PhoneAlreadyExists": "Phone already exists. Choose a different phone number",
    "RequiredFields": "Please fill in all required fields. Complete the necessary information",
    "RoleAlreadyExists": "Role already exists. Choose a different role name",
    "RoleNotFound": "Role not found. Please select a valid role",
    "SomethingWentWrong": "Oops! Something went wrong. Please try again later",
    "SuspendedUser": "Suspended user. Contact support for further assistance",
    "TooManyRequests": "You've made too many requests. Please wait a moment and try again",
    "UserNotFound": "User not found. Please check the information provided",
    "VerificationTokenExpired": "Verification token expired. Request a new verification token",
    "WrongAuthentication": "Authentication failed. Please log in again",
    "WrongCredentials": "Incorrect credentials. Please check your username and password"
}